20240810T122131--kdoc-216-『文字コードの仕組みと歴史入門-なぜ文字化けは起こるのか』__book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-05T19:12:38Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 216: 『文字コードの仕組みと歴史入門: なぜ文字化けは起こるのか』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 216: 『文字コードの仕組みと歴史入門: なぜ文字化けは起こるのか』</h1>
<div id="outline-container-org7e73e9a" class="outline-2">
<h2 id="org7e73e9a"><a href="#org7e73e9a">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org7e73e9a">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-08-10 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-08-25 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org383b5ca" class="outline-2">
<h2 id="org383b5ca"><a href="#org383b5ca">概要</a></h2>
<div class="outline-text-2" id="text-org383b5ca">
<p>
<a href="https://www.amazon.co.jp/gp/product/B0CKF9HTJL/ref=ppx_yo_dt_b_d_asin_title_351_o02?ie=UTF8&amp;psc=1">文字コードの仕組みと歴史入門: なぜ文字化けは起こるのか?</a>は、<a href="20230610224857-character_encoding.html#ID-38001bfe-2387-4cb2-a4e3-6a1d3cc892ea">文字エンコーディング</a>の仕組みと歴史を解説する本。
</p>
</div>
</div>
<div id="outline-container-org8a7f37d" class="outline-2">
<h2 id="org8a7f37d"><a href="#org8a7f37d">メモ</a></h2>
<div class="outline-text-2" id="text-org8a7f37d">
<p>
ひらがなの「あ」の番号の割り当て。
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">名前</td>
<td class="org-right">番号</td>
</tr>

<tr>
<td class="org-left">-------------------</td>
<td class="org-right">------</td>
</tr>

<tr>
<td class="org-left">シフトJIS</td>
<td class="org-right">0x82a0</td>
</tr>

<tr>
<td class="org-left">EUC-JP</td>
<td class="org-right">0xA4A2</td>
</tr>

<tr>
<td class="org-left">JISコード(JIS X0208)</td>
<td class="org-right">0x2422</td>
</tr>

<tr>
<td class="org-left">Unicode</td>
<td class="org-right">0x3042</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>ソフトJISとEUC-JPとJISコード(JIS X 0208)は基本的にJIS X 0208という同じ文字表を使用しているが、番号は同じになっている(p8)</li>
<li>文字表のことを「文字セット」「文字集合」という(p8)</li>
<li>文字を番号に置き換えるルールを「文字エンコーディング」という(p8)</li>
<li>初期の電報はモールス信号で無線送信されたため、和文モールスと同じ制約があった。文字数が通信時間になり料金に反映されるので、簡潔な表現が好まれた。カタカナだけで、空白文字は存在しないため文字の区切りが曖昧になっていた、という(p13)</li>
<li>シフトJISとEUC-JPの最大の違いは、規格としての正しさにある。シフトJISは、勝手にコードをシフトして辻褄を合わせた私的な仕様である(p36)</li>
<li>Unicodeにはすべての文字を16ビットに納めるという大前提があるがこれは絶対に実現できない夢想である。ISO/IEC 10646 DIS1は1文字に32ビットのコードを割り振るが、これはアメリカ人が絶対に許容できない選択肢である。ASCII(8ビット)の資産が使えなくなるため(p41)</li>
<li><a href="https://ja.wikipedia.org/wiki/%E3%83%93%E3%83%A3%E3%83%B3%E3%83%93%E3%83%A3%E3%83%B3%E9%BA%BA">ビャンビャン麺 - Wikipedia</a>(p48)</li>
<li>UTF-16はもっとも基本的な<a href="20230709154946-unicode.html#ID-c76de2cf-e70d-4bc6-aa3a-f14d05debb6e">Unicode</a>のビット表現となったが、処理が複雑で評判がよくなかった。UTF-16の後で8ビット単位でUnicodeをエンコードするUTF-8が誕生した。0~0x7FまではASCIIコードそのもので、0x80~0xFFの領域にその他のすべての文字を押し込む。そのため、1~4バイト長の可変長エンコードである。UTF-8はUTF-FSS(File System Safe)とも呼ばれる。当初はベル研究所のPlan 9のファイル名を記述するエンコードとして考案されたため(p49)</li>
<li>たとえば漢字の「亜」はシフトJIS/EUC-JP/UTF-16では2バイトで表現できるが、UTF-8では3バイトを必要とする。必要とされる記憶容量が増える。こういう日本に不利な仕様を標準として飲まされるのは日本のIT業界の弱体化といえるだろう(p51)</li>
<li>CPUのエンディアンに沿ってデータを扱うと効率がよい。そのため<a href="20230709154946-unicode.html#ID-c76de2cf-e70d-4bc6-aa3a-f14d05debb6e">Unicode</a>にもリトルエンディアンとビックエンディアンの2種類があり、エンディアンを自動判定するための文字が存在する。BOM(U+FEFF byte order mark)である。ファイルの先頭につけておくと、確実にリトルエンディアンかビックエンディアンかを判定できる(p51)</li>
<li>電子メールで文字をエンコードしたければ、Content-Transfer-EncodingヘッダーにQuoted-printableかBase64を指定する。だが、その方法では本文のエンコードを指定できてもヘッダー自身のエンコード方法を指定できない。ヘッダーのエンコードを指定するための書式が存在する(p58)</li>
<li>本来合意されていたのは「Unicodeに統一しよう」ということで、特にUTF-8に統一しようという合意はなかった、という(p61)</li>
<li><a href="20240213004323-c.html#ID-ccab3205-73b6-4009-9ec8-4e08eb1d2003">C#</a>の文字列クラスではUTF-16で文字列を記録する。サロゲートペアを使った1文字の長さを2と報告する。これはすべての文字が16ビットで簡単に処理できると言われた時代に決まった仕様である(p61)</li>
<li>ハイフンとマイナスは区別されないで同じ文字で書かれている(p67)</li>
<li>文字化けが起こる根本的な理由は、今や技術的な理由ではなく、過去の負債にあるといえる。過去の人たちが便利に使うために便宜上決めたことが、未来の我々を苦しめる(p67)</li>
</ul>
</div>
</div>
<div id="outline-container-org7a92561" class="outline-2">
<h2 id="org7a92561"><a href="#org7a92561">関連</a></h2>
<div class="outline-text-2" id="text-org7a92561">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
